src/ChartsOfCharacteristicTypes/СтатьиАктивовПассивов/СтатьиАктивовПассивов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:ChartOfCharacteristicTypes>
  <name>СтатьиАктивовПассивов</name>
  <type>
    <types>CatalogRef.Номенклатура</types>
    <types>CatalogRef.Организации</types>
    <types>CatalogRef.СтруктураПредприятия</types>
    <types>CatalogRef.СтатьиДвиженияДенежныхСредств</types>
    <types>CatalogRef.БанковскиеСчетаОрганизаций</types>
    <types>CatalogRef.Контрагенты</types>
    <types>CatalogRef.Партнеры</types>
    <types>EnumRef.ТипыНалогов</types>
    <types>CatalogRef.ПрочиеАктивыПассивы</types>
    <types>CatalogRef.НаправленияДеятельности</types>
    <types>CatalogRef.ФизическиеЛица</types>
    <types>CatalogRef.Склады</types>
  </type>
  <hierarchical>true</hierarchical>
  <predefined>
    <items>
      <name>ДебиторскаяЗадолженность</name>
      <description>Дебиторская задолженность</description>
      <code>УТ-00000023</code>
    </items>
    <items>
      <name>ДенежныеСредства</name>
      <description>Денежные средства</description>
      <code>УТ-00000020</code>
    </items>
    <items>
      <name>ДепонированнаяЗарплата</name>
      <description>Депонированная зарплата</description>
      <code>УТ-00000032</code>
      <type>
        <types>CatalogRef.ФизическиеЛица</types>
      </type>
    </items>
    <items>
      <name>ИмущественныеНалоги</name>
      <description>Имущественные налоги</description>
      <code>УТ-00000034</code>
      <type>
        <types>CatalogRef.Номенклатура</types>
        <types>CatalogRef.Организации</types>
        <types>CatalogRef.СтруктураПредприятия</types>
        <types>CatalogRef.СтатьиДвиженияДенежныхСредств</types>
        <types>CatalogRef.БанковскиеСчетаОрганизаций</types>
        <types>CatalogRef.Контрагенты</types>
        <types>CatalogRef.Партнеры</types>
        <types>EnumRef.ТипыНалогов</types>
        <types>CatalogRef.ПрочиеАктивыПассивы</types>
        <types>CatalogRef.НаправленияДеятельности</types>
        <types>CatalogRef.ФизическиеЛица</types>
        <types>CatalogRef.Склады</types>
      </type>
    </items>
    <items>
      <name>КредиторскаяЗадолженность</name>
      <description>Кредиторская задолженность</description>
      <code>УТ-00000024</code>
    </items>
    <items>
      <name>Налоги</name>
      <description>Налоги</description>
      <code>УТ-00000035</code>
      <type>
        <types>EnumRef.ТипыНалогов</types>
      </type>
    </items>
    <items>
      <name>НалогиИВзносыСОплатыТруда</name>
      <description>Налоги и взносы с оплаты труда</description>
      <code>УТ-00000031</code>
      <type>
        <types>CatalogRef.Номенклатура</types>
        <types>CatalogRef.Организации</types>
        <types>CatalogRef.СтруктураПредприятия</types>
        <types>CatalogRef.СтатьиДвиженияДенежныхСредств</types>
        <types>CatalogRef.БанковскиеСчетаОрганизаций</types>
        <types>CatalogRef.Контрагенты</types>
        <types>CatalogRef.Партнеры</types>
        <types>EnumRef.ТипыНалогов</types>
        <types>CatalogRef.ПрочиеАктивыПассивы</types>
        <types>CatalogRef.НаправленияДеятельности</types>
        <types>CatalogRef.ФизическиеЛица</types>
        <types>CatalogRef.Склады</types>
      </type>
    </items>
    <items>
      <name>НезавершенноеПроизводство</name>
      <description>Незавершенное производство</description>
      <code>УТ-00000029</code>
      <type>
        <types>CatalogRef.СтруктураПредприятия</types>
      </type>
    </items>
    <items>
      <name>ОплатаТруда</name>
      <description>Оплата труда</description>
      <code>УТ-00000030</code>
      <type>
        <types>CatalogRef.Организации</types>
      </type>
    </items>
    <items>
      <name>ПредметыЛизинга</name>
      <description>Предметы лизинга</description>
      <code>УТ-00000033</code>
      <type>
        <types>CatalogRef.Номенклатура</types>
        <types>CatalogRef.Организации</types>
        <types>CatalogRef.СтруктураПредприятия</types>
        <types>CatalogRef.СтатьиДвиженияДенежныхСредств</types>
        <types>CatalogRef.БанковскиеСчетаОрганизаций</types>
        <types>CatalogRef.Контрагенты</types>
        <types>CatalogRef.Партнеры</types>
        <types>EnumRef.ТипыНалогов</types>
        <types>CatalogRef.ПрочиеАктивыПассивы</types>
        <types>CatalogRef.НаправленияДеятельности</types>
        <types>CatalogRef.ФизическиеЛица</types>
        <types>CatalogRef.Склады</types>
      </type>
    </items>
    <items>
      <name>ПрибылиИУбытки</name>
      <description>Прибыли и убытки</description>
      <code>УТ-00000016</code>
      <type>
        <types>CatalogRef.ПрочиеАктивыПассивы</types>
      </type>
    </items>
    <items>
      <name>ПрочиеАктивы</name>
      <description>Прочие активы</description>
      <code>УТ-00000012</code>
      <type>
        <types>CatalogRef.ПрочиеАктивыПассивы</types>
      </type>
    </items>
    <items>
      <name>ПрочиеПассивы</name>
      <description>Прочие пассивы</description>
      <code>УТ-00000013</code>
      <type>
        <types>CatalogRef.ПрочиеАктивыПассивы</types>
      </type>
    </items>
    <items>
      <name>РасходыБудущихПериодов</name>
      <description>Расходы будущих периодов</description>
      <code>УТ-00000015</code>
      <type>
        <types>CatalogRef.ПрочиеАктивыПассивы</types>
      </type>
    </items>
    <items>
      <name>РасходыТекущегоПериода</name>
      <description>Расходы текущего периода</description>
      <code>УТ-00000014</code>
      <type>
        <types>CatalogRef.ПрочиеАктивыПассивы</types>
      </type>
    </items>
    <items>
      <name>Товары</name>
      <description>Товары</description>
      <code>УТ-00000027</code>
    </items>
    <items>
      <name>ЦелевоеФинансирование</name>
      <description>Целевое финансирование</description>
      <code>УТ-00000036</code>
      <type>
        <types>CatalogRef.НаправленияДеятельности</types>
      </type>
    </items>
  </predefined>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>АктивПассив</name>
    <type>
      <types>EnumRef.ВидыСтатейУправленческогоБаланса</types>
    </type>
  </attributes>
  <attributes>
    <name>РеквизитДопУпорядочивания</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:ChartOfCharacteristicTypes>

src/Enums/ВидыСтатейУправленческогоБаланса/ВидыСтатейУправленческогоБаланса.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыСтатейУправленческогоБаланса</name>
  <enumValues>
    <name>Актив</name>
  </enumValues>
  <enumValues>
    <name>Пассив</name>
  </enumValues>
</mdclass:Enum>

src/Catalogs/ПрочиеАктивыПассивы/ПрочиеАктивыПассивы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ПрочиеАктивыПассивы</name>
  <owners>ChartOfCharacteristicTypes.СтатьиАктивовПассивов</owners>
  <owners>ChartOfCharacteristicTypes.СтатьиРасходов</owners>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/ChartsOfCharacteristicTypes/СтатьиАктивовПассивов/Forms/ФормаЭлемента/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
		Возврат;
	КонецЕсли;

	// Подсистема запрета редактирования ключевых реквизитов объектов
	ЗапретРедактированияРеквизитовОбъектов.ЗаблокироватьРеквизиты(ЭтаФорма);
	
	Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Если Параметры.Свойство("ЗначенияЗаполнения") И Параметры.ЗначенияЗаполнения.Свойство("АктивПассив") Тогда
			Объект.АктивПассив = Параметры.ЗначенияЗаполнения.АктивПассив;
		Иначе
			Объект.АктивПассив = Перечисления.ВидыСтатейУправленческогоБаланса.Актив;
		КонецЕсли;
	КонецЕсли;
	ЗаполнитьСписокВыбораТиповЗначенийАналитики();
	
	МенюОтчеты.ПриСозданииНаСервере(ЭтаФорма, Элементы.ПодменюОтчеты);
	
	// СтандартныеПодсистемы.Свойства
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ИмяЭлементаДляРазмещения", "ГруппаДополнительныеРеквизиты");
	УправлениеСвойствами.ПриСозданииНаСервере(ЭтаФорма, ДополнительныеПараметры);

КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	Если Не ПустаяСтрока(ТипЗначения) Тогда
		ТекущийОбъект.ТипЗначения = Новый ОписаниеТипов(ТипЗначения);
	КонецЕсли;
	Если АктивПассив = "Актив" Тогда
		ТекущийОбъект.АктивПассив = Перечисления.ВидыСтатейУправленческогоБаланса.Актив;
	Иначе
		ТекущийОбъект.АктивПассив = Перечисления.ВидыСтатейУправленческогоБаланса.Пассив;
	КонецЕсли;
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ПередЗаписьюНаСервере(ЭтаФорма, ТекущийОбъект);

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствамиКлиент.ПослеЗагрузкиДополнительныхРеквизитов(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.Свойства
	
	УстановитьПризнакАктивПассив();
	УстановитьТипЗначения(Объект.ТипЗначения);
	УправлениеВидимостью();
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	// подсистема запрета редактирования ключевых реквизитов объектов
	ЗапретРедактированияРеквизитовОбъектов.ЗаблокироватьРеквизиты(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	// СтандартныеПодсистемы.Свойства 
	Если УправлениеСвойствамиКлиент.ОбрабатыватьОповещения(ЭтаФорма, ИмяСобытия, Параметр) Тогда
		ОбновитьЭлементыДополнительныхРеквизитов();
		УправлениеСвойствамиКлиент.ПослеЗагрузкиДополнительныхРеквизитов(ЭтотОбъект);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ПриЧтенииНаСервере(ЭтаФорма, ТекущийОбъект);
	
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ОбработкаПроверкиЗаполнения(ЭтаФорма, Отказ, ПроверяемыеРеквизиты);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ТипЗначенияПриИзменении(Элемент)
	
	УправлениеВидимостью();
	
КонецПроцедуры

&НаКлиенте
Процедура АктивПассивПриИзменении(Элемент)
	ЗаполнитьСписокВыбораТиповЗначенийАналитики()
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ЗначенияПрочихАктивовПассивов(Команда)
	
	Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
		
		ТекстВопроса = НСтр("ru='Данные еще не записаны.
        |Переход к значениям прочих активов и пассивов возможен только после записи данных.
        |Данные будут записаны.'
        |;uk='Дані ще не записані.
        |Перехід до значень інших активів і пасивів можливий тільки після запису даних.
        |Дані будуть записані.'");
		
		ПоказатьВопрос(Новый ОписаниеОповещения("ЗначенияПрочихАктивовПассивовЗавершение", ЭтотОбъект), ТекстВопроса, РежимДиалогаВопрос.ОКОтмена);
        Возврат;
		
	КонецЕсли;
	
	ЗначенияПрочихАктивовПассивовФрагмент();
КонецПроцедуры

&НаКлиенте
Процедура ЗначенияПрочихАктивовПассивовЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
    
    Если РезультатВопроса = КодВозвратаДиалога.Отмена Тогда
        Возврат;
    КонецЕсли;
    
    Попытка
        ЭлементЗаписан = Записать();
    Исключение
        Возврат;
    КонецПопытки;
    
    Если Не ЭлементЗаписан Тогда
        Возврат;
    КонецЕсли;
    
    
    ЗначенияПрочихАктивовПассивовФрагмент();

КонецПроцедуры

&НаКлиенте
Процедура ЗначенияПрочихАктивовПассивовФрагмент()
    
    СтруктураОтбора = Новый Структура("Владелец", Объект.Ссылка);
    ПараметрыФормы = Новый структура("Отбор", СтруктураОтбора);
    ОткрытьФорму("Справочник.ПрочиеАктивыПассивы.ФормаСписка", ПараметрыФормы, ЭтаФорма);

КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_РедактироватьСоставСвойств()
	
	УправлениеСвойствамиКлиент.РедактироватьСоставСвойств(ЭтаФорма, Объект.Ссылка);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область УправлениеЭлементамиФормы

&НаКлиенте
Процедура УправлениеВидимостью()
	
	Если ТипЗначения = "СправочникСсылка.ПрочиеАктивыПассивы" Тогда
		Элементы.СтраницыПрочиеАктивыПассивы.ТекущаяСтраница = Элементы.СтраницаЗначенияПрочихАктивовПассивов;
	Иначе
		Элементы.СтраницыПрочиеАктивыПассивы.ТекущаяСтраница = Элементы.СтраницаПрочиеАктивыПассивыПустая;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСписокВыбораТиповЗначенийАналитики()
	
	СписокТиповЗначенийАналитик = Новый СписокЗначений;
	Элементы.ТипЗначения.СписокВыбора.Очистить();
	Если ПолучитьФункциональнуюОпцию("ИспользоватьПодразделения") Тогда
		СписокТиповЗначенийАналитик.Добавить("СправочникСсылка.СтруктураПредприятия", НСтр("ru='Подразделение';uk='Підрозділ'"));
	КонецЕсли;
	СписокТиповЗначенийАналитик.Добавить("СправочникСсылка.ФизическиеЛица", НСтр("ru='Физическое лицо';uk='Фізична особа'"));
	СписокТиповЗначенийАналитик.Добавить("СправочникСсылка.Партнеры", НСтр("ru='Партнер';uk='Партнер'"));
	СписокТиповЗначенийАналитик.Добавить("СправочникСсылка.Контрагенты", НСтр("ru='Контрагент';uk='Контрагент'"));
	СписокТиповЗначенийАналитик.Добавить("СправочникСсылка.Номенклатура", НСтр("ru='Позиция номенклатуры';uk='Позиція номенклатури'"));
	СписокТиповЗначенийАналитик.Добавить("СправочникСсылка.БанковскиеСчетаОрганизаций", НСтр("ru='Банковский счет организации';uk='Банківський рахунок організації'"));
	СписокТиповЗначенийАналитик.Добавить("СправочникСсылка.СтатьиДвиженияДенежныхСредств", НСтр("ru='Статья движения денежных средств';uk='Стаття руху грошових коштів'"));
	СписокТиповЗначенийАналитик.Добавить("СправочникСсылка.Организации", НСтр("ru='Организация';uk='Організація'"));
	СписокТиповЗначенийАналитик.Добавить("СправочникСсылка.Склады", НСтр("ru='Склад (складская территория)';uk='Склад (складська територія)'"));
	СписокТиповЗначенийАналитик.Добавить("ПеречислениеСсылка.ТипыНалогов", НСтр("ru='Типы налогов';uk='Типи податків'"));
	Если ПустаяСтрока(АктивПассив) Тогда
		АктивПассив = Строка(Перечисления.ВидыСтатейУправленческогоБаланса.Пассив);
	КонецЕсли;
	Если АктивПассив = "Пассив" Тогда
		СписокТиповЗначенийАналитик.Добавить("СправочникСсылка.НаправленияДеятельности", НСтр("ru='Направление деятельности';uk='Напрям діяльності'"));
	КонецЕсли;

	Для Каждого ДобавляемыйЭлемент Из СписокТиповЗначенийАналитик Цикл
		Элементы.ТипЗначения.СписокВыбора.Добавить(ДобавляемыйЭлемент.Значение, ДобавляемыйЭлемент.Представление);
	КонецЦикла;
	
	Элементы.ТипЗначения.СписокВыбора.СортироватьПоПредставлению();
	Элементы.ТипЗначения.СписокВыбора.Добавить("СправочникСсылка.ПрочиеАктивыПассивы", НСтр("ru='Прочий актив или пассив';uk='Інший актив чи пасив'"));
	
КонецПроцедуры

#КонецОбласти

#Область Прочее

&НаКлиенте
Процедура УстановитьТипЗначения(ВыбранныйТипЗначения)
	
	СписокТиповЗначений = Новый СписокЗначений;
	СписокТиповЗначений.Добавить("СправочникСсылка.СтруктураПредприятия");
	СписокТиповЗначений.Добавить("СправочникСсылка.Партнеры");
	СписокТиповЗначений.Добавить("СправочникСсылка.Контрагенты");
	СписокТиповЗначений.Добавить("СправочникСсылка.Организации");
	СписокТиповЗначений.Добавить("СправочникСсылка.Склады");
	СписокТиповЗначений.Добавить("СправочникСсылка.Номенклатура");
	СписокТиповЗначений.Добавить("СправочникСсылка.ФизическиеЛица");
	СписокТиповЗначений.Добавить("СправочникСсылка.БанковскиеСчетаОрганизаций");
	СписокТиповЗначений.Добавить("СправочникСсылка.СтатьиДвиженияДенежныхСредств");
	СписокТиповЗначений.Добавить("СправочникСсылка.ПрочиеАктивыПассивы");
	СписокТиповЗначений.Добавить("ПеречислениеСсылка.ТипыНалогов");
	
	Для Каждого ЭлементСписка Из СписокТиповЗначений Цикл
		Если ВыбранныйТипЗначения.СодержитТип(Тип(ЭлементСписка.Значение)) Тогда
			ТипЗначения = ЭлементСписка.Значение;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьПризнакАктивПассив()
	
	Если Объект.АктивПассив = ПредопределенноеЗначение("Перечисление.ВидыСтатейУправленческогоБаланса.Актив") Тогда
		АктивПассив = "Актив";
	Иначе
		АктивПассив = "Пассив";
	КонецЕсли;
	
Конецпроцедуры

&НаКлиенте
Процедура Подключаемый_РазрешитьРедактированиеРеквизитовОбъекта(Команда)
	
	Если Не Объект.Ссылка.Пустая() Тогда
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("ЭтоПредопределенныйЭлемент", Объект.Предопределенный);
		Результат = Неопределено;

		ОткрытьФорму("ПланВидовХарактеристик.СтатьиАктивовПассивов.Форма.РазблокированиеРеквизитов", ПараметрыФормы,,,,, Новый ОписаниеОповещения("Подключаемый_РазрешитьРедактированиеРеквизитовОбъектаЗавершение", ЭтотОбъект), РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_РазрешитьРедактированиеРеквизитовОбъектаЗавершение(Результат, ДополнительныеПараметры) Экспорт
    
    Если ТипЗнч(Результат) = Тип("Массив") И Результат.Количество() > 0 Тогда
        ЗапретРедактированияРеквизитовОбъектовКлиент.УстановитьДоступностьЭлементовФормы(ЭтаФорма, Результат);
    ИначеЕсли ТипЗнч(Результат) = Тип("Строка") Тогда
        ПоказатьПредупреждение(Неопределено, Результат);
    КонецЕсли;

КонецПроцедуры

// СтандартныеПодсистемы.Свойства 

&НаКлиенте
Процедура ОбновитьЗависимостиДополнительныхРеквизитов()
	УправлениеСвойствамиКлиент.ОбновитьЗависимостиДополнительныхРеквизитов(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПриИзмененииДополнительногоРеквизита(Элемент)
	УправлениеСвойствамиКлиент.ОбновитьЗависимостиДополнительныхРеквизитов(ЭтотОбъект);
КонецПроцедуры
&НаСервере
Процедура ОбновитьЭлементыДополнительныхРеквизитов()

	УправлениеСвойствами.ОбновитьЭлементыДополнительныхРеквизитов(ЭтаФорма);

КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуОтчет(Команда)
	
	МенюОтчетыКлиент.ВыполнитьПодключаемуюКомандуОтчет(Команда, ЭтаФорма, Объект);
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти
